sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/setRelationship.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.setRelationship">
   <soapenv:Header/>
   <soapenv:Body>
     <sug:sugarcrmUrl>https://gogqcl5763.trial.sugarcrm.eu//soap.php</sug:sugarcrmUrl>
     <sug:session>2qktfs6mumoqs2vdbgbe74dsl7</sug:session>
     <sug:module1>Accounts</sug:module1>
     <sug:module1_id>4f133329-7d60-8b1a-60c5-523cee8eadee</sug:module1_id>
     <sug:module2>Contacts</sug:module2>
     <sug:module2_id>f324919b-02c5-bde3-58eb-523cc7d69bb1</sug:module2_id>
   </soapenv:Body>
</soapenv:Envelope>